OdDAI.DaiException.functionId
\details
Returns the name of the function in which the exception occurred.
\returns
const char pointer to the name of the function in which the exception occurred.

OdDAI.DaiException.description
\details
Returns description of an error code of this exception.
\returns
Const char pointer to a description of an Error code of this exception.

OdDAI.DaiException.errorId
\details
Returns an error code of this exception.
\returns
Error code of this exception as daiErrorId type.

OdDAI.DaiException.Minor
\details
Returns an error code of this exception.
\returns
Error code of this exception as daiErrorId type.

OdDAI.DaiException.op_Assign(OdDAI.DaiException!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the DaiException class.
\param exception         [in] Exception to assign.
\returns
Reference to this DaiException object.

OdDAI.DaiException.Dispose
\details
Destructor for the DaiException class.

OdDAI.DaiException.#ctor(OdDAI.DaiException!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the DaiException class.
\param exception         [in] Exception to copy.

OdDAI.DaiException.#ctor(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Constructor for the DaiException class.
\param minor            [in] Error identifier.
\param errorDescription [in/out] Error description text, can be NULL. If NULL, receives description text of an error code.
\param functionId       [in] Function in which the exception occurred.